src/Server/Samples/GetMediaURIRequest.xml

<?xml version="1.0" encoding="utf-8" ?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.sonos.com/Services/1.1">
  <soap:Body>
    <ns:getMediaURI>
      <ns:id>track001</ns:id>
    </ns:getMediaURI>
  </soap:Body>
</soap:Envelope>