src/Castos.Api/Samples/GetMetadataRequest.xml

<?xml version="1.0" encoding="utf-8" ?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <getMetadata xmlns="http://www.sonos.com/Services/1.1">
      <id>root</id>
      <index>0</index>
      <count>99</count>
    </getMetadata>
  </soap:Body>
</soap:Envelope>