src/Castos.Api/Samples/GetMediaMetadataRequest.xml

<?xml version="1.0" encoding="utf-8" ?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <getMediaMetadata xmlns="http://www.sonos.com/Services/1.1">
      <id>track61</id>
    </getMediaMetadata>
  </soap:Body>
</soap:Envelope>