test/getMediaURI.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.sonos.com/Services/1.1">
  <soap:Body>
    <ns:getMediaURI>
      <ns:id>vinyl</ns:id>
    </ns:getMediaURI>
  </soap:Body>
</soap:Envelope>